/// <summary>
/// Інтерфейс IHealth представляє об'єкти, які мають здоров'я.
/// Це можуть бути персонажі, будівлі, або будь-які інші об'єкти в грі, які можуть отримувати пошкодження.
/// </summary>
public interface IHealth
{
    /// <summary>
    /// Застосовує пошкодження до об'єкта.
    /// </summary>
    /// <param name="damage">Кількість пошкоджень, які будуть застосовані до об'єкта.</param>
    void Damage(float damage);

    /// <summary>
    /// Отримує поточне здоров'я об'єкта.
    /// </summary>
    float Health { get; }
}
