/// <summary>
/// Інтерфейс ILevel представляє об'єкти, які мають рівень.
/// Це можуть бути персонажі, будівлі, або будь-які інші об'єкти в грі, які можуть підвищувати або знижувати свій рівень.
/// </summary>
public interface ILevel
{
    /// <summary>
    /// Отримує поточний рівень об'єкта.
    /// </summary>
    int Level { get; }

    /// <summary>
    /// Підвищує рівень об'єкта.
    /// </summary>
    void LevelUp();

    /// <summary>
    /// Знижує рівень об'єкта.
    /// </summary>
    void LevelDown();
}