namespace Systems.CustomInterface
{
    /// <summary>
    /// Інтерфейс IPower представляє об'єкти, які мають певну "силу" або "потужність".
    /// Це можуть бути персонажі, будівлі, або будь-які інші об'єкти в грі, які можуть змінювати свою "силу".
    /// </summary>
    public interface IPower
    {
        /// <summary>
        /// Властивість Power представляє поточну "силу" об'єкта.
        /// Значення "сили" може коливатися від 0 (об'єкт без "сили") до деякого максимального значення (об'єкт з максимальною "силою").
        /// </summary>
        float Power { get; set; }

        /// <summary>
        /// Метод IncreasePower збільшує поточну "силу" об'єкта на вказану кількість.
        /// Це може використовуватися, наприклад, при збільшенні "сили" в результаті покращення або рівня.
        /// </summary>
        /// <param name="amount">Кількість "сили", на яку збільшується поточна "сила".</param>
        void IncreasePower(float amount);

        /// <summary>
        /// Метод DecreasePower зменшує поточну "силу" об'єкта на вказану кількість.
        /// Це може використовуватися, наприклад, при зменшенні "сили" в результаті пошкодження або втрати рівня.
        /// </summary>
        /// <param name="amount">Кількість "сили", на яку зменшується поточна "сила".</param>
        void DecreasePower(float amount);
    }
}